In [1]:
import pandas as pd

In [3]:
dfdept = pd.read_csv("Depts.csv") 
dfdept

   DepartmentId    JobTitle
0           101   Marketing
1           102       Sales
2           103          IT
3           104  Accounting

In [5]:
dfemp = pd.read_csv("Employees.csv") 
dfemp.head()

   EmpId  EmpName Gender  DepartmentId         DOJ Country
0   1001    Jones      M           101  10/27/1980     USA
1   1002   Kivell      M           102  10/28/1980     USA
2   1003  Jardine      M           103  10/29/1981     USA
3   1004     Gill      M           103  10/30/1981     USA
4   1005  Sorvino      F           103  10/31/1985     USA

In [6]:
df=pd.merge(dfemp,dfdept,on="DepartmentId", how='inner')
df

    EmpId    EmpName Gender  DepartmentId         DOJ Country    JobTitle
0    1001      Jones      M           101  10/27/1980     USA   Marketing
1    1007     Howard      M           101   11/2/1991     USA   Marketing
2    1013  Alexander      M           101   11/8/2001      UK   Marketing
3    1016      Ethan      M           101  11/11/2013      UK   Marketing
4    1019   Isabella      F           101  11/14/2015      UK   Marketing
5    1022      Emily      F           101  11/17/2016      UK   Marketing
6    1024   Thompson      M           101  11/19/2018      UK   Marketing
7    1002     Kivell      M           102  10/28/1980     USA       Sales
8    1006    Andrews      M           102   11/1/1985     USA       Sales
9    1011      Jacob      M           102   11/6/1995      UK       Sales
10   1015     Olivia      F           102  11/10/2013      UK       Sales
11   1017     Elijah      M           102  11/12/2015      UK       Sales
12   1021      Robin      M           102  11/16/2016      UK       Sales
13   1003    Jardine      M           103  10/29/1981     USA          IT
14   1004       Gill      M           103  10/30/1981     USA          IT
15   1005    Sorvino      F           103  10/31/1985     USA          IT
16   1010    William      M           103   11/5/1995     USA          IT
17   1018       Noah      M           103  11/13/2015      UK          IT
18   1008      Smith      M           104   11/3/1991     USA  Accounting
19   1009   Benjamin      M           104   11/4/1991     USA  Accounting
20   1012       Emma      F           104   11/7/2001      UK  Accounting
21   1014       Liam      M           104   11/9/2013      UK  Accounting
22   1020      Mason      M           104  11/15/2015      UK  Accounting

In [7]:
df.groupby('JobTitle')['EmpId'].count()

JobTitle
Accounting    5
IT            5
Marketing     7
Sales         6
Name: EmpId, dtype: int64